doomEmacs/.config/doom/README.org
#+title: Configuración de Doom Emacs
#+auto_tangle: t

* Tabla de contenidos :toc:
- [[#tangle-config-packages][Tangle config-packages]]
- [[#comandos-básicos-de-configuración][Comandos Básicos de configuración]]
- [[#initel][init.el]]
  - [[#completion][completion]]
  - [[#ui][UI]]
  - [[#editor][Editor]]
  - [[#terminal][Terminal]]
  - [[#tools][Tools]]
  - [[#lang][Lang]]
- [[#aspecto-visual][Aspecto visual]]
  - [[#tipografía][Tipografía]]
  - [[#tema][Tema]]
  - [[#numeración-de-lineas][Numeración de lineas]]
  - [[#frame][Frame]]
  - [[#banner-de-bienvenida][Banner de bienvenida]]
- [[#utilidades][Utilidades]]
  - [[#visor-pdf][Visor PDF]]
  - [[#dired-y-dirvish][Dired y dirvish]]
  - [[#modo-abreviado][Modo abreviado]]
  - [[#diccionario-personal][Diccionario personal]]
  - [[#hooks][Hooks]]
- [[#org-mode][Org-mode]]
  - [[#directorioscarpetas-de-org-mode][Directorios/carpetas de org-mode]]
  - [[#org-agenda][Org Agenda]]
  - [[#plugin-org-journal][Plugin: org-journal]]
  - [[#plugin-org-roam][Plugin: org-roam]]
  - [[#plugin-org-roam-bibtex-orb][Plugin: org-roam-bibtex (orb)]]
  - [[#plugin-org-auto-tangle][Plugin: org-auto-tangle]]
- [[#lenguajes][Lenguajes]]
  - [[#typst][Typst]]
- [[#extras][Extras]]
  - [[#plugin-evil-tutor][Plugin: evil-tutor]]
- [[#comentarios-originales][Comentarios Originales]]
  - [[#config][Config]]
  - [[#packages][Packages]]

* Tangle config-packages

#+begin_src elisp :tangle config.el

;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

#+end_src
#+begin_src elisp :tangle packages.el

;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

#+end_src


* Comandos Básicos de configuración
- *~doom doctor~*
  Diagnostica problemas en la configuración y puede sugerirte cómo solucionarlo.
- *~doom sync~*
  Sincronizar las configuraciones de Doom Emacs con Emacs. Activa módulos del
  ~init.el~, descarga paquetes del ~packages.el~, y verifica que no haya
  errores.
  OJO: no carga cosas que estén en ~config.el~, para eso se necesita reiniciar.
- *~doom gc~*
  Para limpiar los paquetes y módulos que no estén cargados.


* init.el
** completion
- Dejar activado ~vertico~ para las citas de Typst.
** UI
- Activar ~indent-guides~.
- Activar ~ligatures~.
- Activar ~smooth-scroll~.
- Activar ~treemacs~.
- Desactivar '+pretty' en ~vc-gutter~ porque me gustan los indicadores toscos.
** Editor
- Activar ~(format +onsave)~.
- Activar ~word-wrap~ (para lenguajes de programación).
** Terminal
De las cuatro disponibles (eshell, shell, term, vterm), elegí:
 - ~eshell~ porque es la que tiene más cosas. Está escrita en elisp, entiende
   comandos de Emacs nativamente, más dificil de usar, pero algunos programas de
   terminal no sirven.
 - ~vterm~ porque es un emulador de la terminal del sistema, por lo que es
   igualita a la que ya uso en Kitty.
** Tools
- Activar ~biblio~ para org-roam-bibtex y Typst.
- Dejar activado ~lookup~ para las citas de Typst
- Activar ~(lsp +eglot)~ y ~tree-sitter~ para Typst.
- Activar ~pdf~. REVISAR: [[*Visor PDF][Visor PDF]]
** Lang
- Activar ~(org +journal +roam)~


* Aspecto visual
** Tipografía

Para Doom emacs, hay 5 variables para controlar las fuentes. A parte de la
fuente primaria, el resto son opcionales
- ~doom-font~ es fuente primaria (monoespaciada).
- ~doom-variable-pitch-font~ es una fuente que no es monoespaciada
- ~doom-big-font~ es la fuente utilizada para =doom-big-font-mode=. Este modo
  es útil para presentaciones o video streaming.
- ~doom-symbol-font~ para /símbolos.
- ~doom-serif-font~ para la fuente ~fixed-pitch-serif~ (no sé cómo usarla).

#+begin_src elisp :tangle config.el
(setq doom-font
      (font-spec
       :family "Monaspace Xenon Frozen"
       :size 16 :weight 'regular)
      doom-variable-pitch-font
      (font-spec
       :family "Public Sans"
       :size 18)
      doom-serif-font
      (font-spec
       :family "Monaspace Argon Frozen"
       :size 16))

(custom-set-faces!
  '(italic
    :family "Monaspace Radon Frozen"
    :slant italic))
#+end_src

Una función poderosa de emacs son los /faces/ que serían como estilos de fuente
que podemos configurar para ciertos casos. En la configuración de arriba, se
configuró una para que el texto en italicas tenga una fuente distinta.

*** Ligaduras

Primero hay que activar =ligatures= en el ~init.el~. Y se activan así:

#+begin_src elisp :tangle config.el
(use-package ligature
  :config
  (ligature-set-ligatures
   't   ; Para activarlo en todos los modos
   '(;; ss01 – Equality / comparison (JS-style)
     "===" "!==" "=!=" "=/=" "/==" "/=" "#="
     "==" "!=" "~~" "=~" "!~" "~-" "-~" "&="
     ;; ss02 – Relational
     ">=" "<="
     ;; ss03 – Arrows with tilde/dash
     "<-->" "<->" "<!--" "<--" "-->" "<-" "->"
     "<~>" "<~~" "~~>" "<~" "~>"
     ;; ss04 – XML / JSX
     "</" "/>" "</>" "<>"
     ;; ss05 – Pipe / functional (F#, Haskell)
     "[|" "|]" "/\\" "\\/" "|>" "<|" "<|>" "{|" "|}"
     ;; ss06 – Repeating operators
     "###" "+++" "&&&"
     ;; ss07 – Colon combinators
     "-:-" "=:=" ":>:" ":<:" "::>" "<::" "::" ":::"
     ;; ss08 – Dot operators
     "..=" "..-" "..<" ".=" ".-"
     ;; ss09 – Shift / fat arrows
     "<=>" "<<=" "=>>" "=<<" ">>=" "=>" "<<" ">>"
     ;; ss10 – Clojure / reader macros
     "#[" "#(" "#!["
     ;; liga – Spacing utilities
     "..." "///" "//" "!!" "||" ";;" ";;;"))
    (global-ligature-mode t))
#+end_src

** Tema

Luego de instalar un tema, o elegir uno de los que trae doom, hay que cargarlo
usando ~doom-theme~ en la configuración. O también, puedes cargarlo usando
=M-x load-theme=, pero este sólo estará temporalmente.

#+begin_src elisp :tangle packages.el
(package! catppuccin-theme)
#+end_src

#+begin_src elisp :tangle config.el
;; (setq doom-theme 'catppuccin)
#+end_src

Otros temas que he probado son:

#+begin_src elisp

; doom-palenight         ; Predeterminado pero poquito mejor
; doom-nord              ; Muy gris para mí
; doom-wilmersdorf       ; El mejor org, pero lo demás lo resalta gris
; doom-spacegrey         ; Muy gris, Buen naranja, pero no resalta org
; doom-moonlight         ; Buen org, no me gusta el ambiente morado
; doom-opera-light       ; Tema claro
; doom-monokai-spectrum  ; Tema oscuro
; doom-monokai-pro       ; Tema oscuro
; doom-tokyo-night       ; Tema oscuro
; doom-oceanic-next      ; Tema oscuro

; doom-flatwhite         ; Tema claro
; doom-material-dark     ; Tema oscuro
; doom-tomorrow-day      ; Tema claro
; doom-tomorrow-night    ; Buen color, org no me convence

#+end_src

*** Plugin: Auto-Dark

Se trata de un plugin que permite sincronizar el modo oscuro.
Requiere instalar el paquete y configurar su comportamiento.

#+begin_src elisp :tangle packages.el
(package! auto-dark)
#+end_src

Caso específico de cappuccin

#+begin_src elisp :tangle config.el
(use-package! auto-dark
  :defer t
  :init
  ;; Usamos catppuccin en ambos slots; el flavor cambia vía hooks
  (setq! auto-dark-themes '((catppuccin) (catppuccin)))
  ;; Disable doom's theme loading mechanism (just to make sure)
  (setq! doom-theme nil)
  ;; Declare that all themes are safe to load.
  (setq! custom-safe-themes t)
  ;; Hooks para cambiar el flavor según el modo del sistema
  (setq! auto-dark-dark-mode-hook
         (list (lambda ()
                 (setq catppuccin-flavor 'mocha)
                 (catppuccin-reload))))
  (setq! auto-dark-light-mode-hook
         (list (lambda ()
                 (setq catppuccin-flavor 'latte)
                 (catppuccin-reload))))
  (defun my-auto-dark-init-h ()
    (auto-dark-mode)
    (remove-hook 'server-after-make-frame-hook #'my-auto-dark-init-h)
    (remove-hook 'after-init-hook #'my-auto-dark-init-h))
  (let ((hook (if (daemonp)
                  'server-after-make-frame-hook
                'after-init-hook)))
    (add-hook hook #'my-auto-dark-init-h -95)))
#+end_src

Para temas que no son cappuccin

#+begin_src elisp :tangle-no
(use-package! auto-dark
 :defer t
 :init
 ;; Configure themes (Oscuro / Claro)
 (setq! auto-dark-themes '((doom-tomorrow-night) (doom-tomorrow-day)))
 ;; Disable doom's theme loading mechanism (just to make sure)
 (setq! doom-theme nil)
 ;; Declare that all themes are safe to load.
 ;; Be aware that setting this variable may have security implications if you
 ;; get tricked into loading untrusted themes (via auto-dark-mode or manually).
 ;; See the documentation of custom-safe-themes for details.
 (setq! custom-safe-themes t)
 ;; Enable auto-dark-mode at the right point in time.
 ;; This is inspired by doom-ui.el. Using server-after-make-frame-hook avoids
 ;; issues with an early start of the emacs daemon using systemd, which causes
 ;; problems with the DBus connection that auto-dark mode relies upon.
 (defun my-auto-dark-init-h ()
   (auto-dark-mode)
   (remove-hook 'server-after-make-frame-hook #'my-auto-dark-init-h)
   (remove-hook 'after-init-hook #'my-auto-dark-init-h))
 (let ((hook (if (daemonp)
                 'server-after-make-frame-hook
               'after-init-hook)))
   ;; Depth -95 puts this before doom-init-theme-h, which sounds like a good
   ;; idea, if only for performance reasons.
   (add-hook hook #'my-auto-dark-init-h -95)))
#+end_src

Actualmente estoy usando cappuccin, por lo que el tangle va para ese.

** Numeración de lineas

Es posible elegir entre tres modos de numeración de lineas
- ~nil~ desactivado
- ~t~ numeración absoluta
- ~'relative~ numeración relativa al cursor

#+begin_src elisp :tangle config.el
(setq display-line-numbers-type 'relative)
#+end_src

Notar que para la numeración relativa hay que anteponer una comilla simple.

** Frame

Se puede hacer que la ventana tenga cierto tamaño al iniciar

#+begin_src elisp :tangle-no
;; == Definir el tamaño de la ventana al iniciar ==
(add-hook 'emacs-startup-hook
  (lambda ()
    (when (display-graphic-p)
      (set-frame-size (selected-frame) 90 40)  ;; Ancho y alto en caracteres
      (set-frame-position (selected-frame) 100 50))))  ;; Posición en píxeles

;; == Abrir emacs maximizado ==
;; (add-hook 'window-setup-hook 'toggle-frame-maximized)
#+end_src

Actualmente no se está haciendo tangle porque uso un Tiling Window Manager.

** Banner de bienvenida

Para cambiarlo las letras grandes de DOOM EMACS por una imagen:
#+begin_src elisp :tangle-no
(setq fancy-splash-image (concat doom-private-dir "assets/emacs-e-logo(naranja).png"))
#+end_src

Actualmente no se hace tangle porque es para referencia (temporalmente).


* Utilidades
** Visor PDF

En init-tools activa ~pdf~. Luego tendrás que instalar el server 'epdfinfo' el
cual vinene integrado en 'pdf-tools'.
 - Linux normal: usar el comando ~M-x pdf-tools-install~.
 - NixOS: añadir ~pkgs.emacsPackages.pdf-tools~ a la lista de paquetes.

Después, se añade lo siguiente a Emacs
#+begin_src elisp :tangle packages.el
(package! pdf-tools :built-in 'prefer)
#+end_src

Esto le dice a Doom que use la versión que ya instaló Nix.

** Dired y dirvish

Ambos son exploradores de archivos que vienen instalados en Doom Emacs. La
peculiaridad de Dired es que es un buffer de emacs, por lo que se pueden
realizar ediciones como si fuera un archivo de texto.

Y el caso de dirvish es que resulta más rapido para navegar y revisar archivos,
ya que tiene vista previa de archivos. Por defecto puede ver cualquier archivo
de texto, pero para imágenes y PDF hay que instalar:
 - ~vipsthumbnail~ para las imágenes.
 - ~pdftoppm~ para los PDF.


#+begin_src elisp :tangle config.el

;; Eliminar moviendo a la papelera
(setq delete-by-moving-to-trash t)

;; Abrir dirvish (dired pero mejor)
(map! :leader
      :desc "Dirvish" "o _" #'dirvish)

#+end_src

** Modo abreviado

#+begin_src elisp :tangle-no

;; Activar el modo abreviado
(add-hook 'text-mode-hook #'abbrev-mode)
;(add-hook 'typst-mode-hook #'abbrev-mode)

#+end_src

** Diccionario personal

#+begin_src elisp :tangle-no

;; Diccionario personal
(setq ispell-personal-dictionary "~/.config/doom/mis-palabras.pws")

;; Configurar la detección del lenguaje automático
;(use-package! guess-language
;  :hook (text-mode . guess-language-mode)
;  :config
;  (setq guess-language-languages '(es en)
;        guess-language-min-paragraph-length 35))

#+end_src

** Hooks

#+begin_src elisp :tangle-no

;; Saltos de linea duros en org mode
(add-hook 'org-mode-hook (lambda ()
  (auto-fill-mode 1)            ; hard wrap ON
  (setq-local fill-column 80)   ; ancho del wrap
  (setq-local word-wrap nil)))  ; soft wrap visual OFF

(after! markdown-mode
  (add-hook 'markdown-mode-hook #'variable-pitch-mode)
  (add-hook 'markdown-mode-hook #'visual-fill-column-mode)
  (setq visual-fill-column-width 80))
#+end_src

*** Navegar entre lineas visuales
#+begin_src elisp :tangle config.el
(add-hook! 'text-mode-hook
  (evil-local-set-key 'normal (kbd "j") #'evil-next-visual-line)
  (evil-local-set-key 'motion (kbd "j") #'evil-next-visual-line)
  (evil-local-set-key 'normal (kbd "k") #'evil-previous-visual-line)
  (evil-local-set-key 'motion (kbd "k") #'evil-previous-visual-line))
#+end_src


* Org-mode
** Directorios/carpetas de org-mode

Los directorios y su función son:
 - ~org-directory~ donde se guardan los archivos org por defecto. En mi caso
   lo utilizo para las notas jerárquicas. Debe de ponerse antes de cargar org.

#+begin_src elisp :tangle config.el
(setq org-directory "~/Documents/Emacs/Notas")
#+end_src

** Org Agenda

Es una funcionalidad de Emacs para crear recordatorios, desprendiendo funciones
como la gestión de tareas, programar eventos, calendario, repeticiones, etc.

Para que las tareas se muestren en esta función hay que especificar desde qué
carpetas las va a buscar:
#+begin_src elisp :tangle config.el
(setq org-agenda-files
      (list org-directory
            "~/Documents/Emacs/Roam/"
            "~/Documents/Emacs/Roam/journal/"))
#+end_src

En mi caso, configuré las de Roam. Como ves, no escanea recursivamente.

** Plugin: org-journal

En ~init.el~ ubicamos =org= y añadimos la bandera '+journal'. Ej:
#+begin_src elisp
(org
 +journal)
#+end_src

Luego, hay que definir la carpeta donde estarán los archivos de diario, cómo se
llamará el archivo y el título del mismo:
#+begin_src elisp :tangle config.el
(setq org-journal-dir "~/Documents/Emacs/Diario/"
      org-journal-date-prefix "#+title: "
      org-journal-time-prefix "\n* "
      org-journal-date-format "%A, %d/%b/%Y"
      org-journal-file-format "%Y-%m-%d.org")
#+end_src

** Plugin: org-roam

En ~init.el~ ubicamos =org= y añadimos la bandera '+roam'. Ej:
#+begin_src elisp
(org
 +roam)
#+end_src

Ahora hay que configurar el directorio de Roam
#+begin_src elisp :tangle config.el
(setq org-roam-directory "~/Documents/Emacs/Roam"
      org-roam-dailies-directory "journal/")
#+end_src

Hay dos cosas *MUY IMPORTANTES*:
 1. Utiliza una carpeta dedicada solamente a org-roam. Este plugin trabaja con
    metadatos que solo los archivos generados por él tienen, por lo cual
    conviene separar a las notas que no tienen dichos datos.
 2. Este plugin usa una base de datos, NO EDITES POR FUERA DE ESTE PLUGIN. de
    hacerlo, estarías desactualizando la base de datos.

También definí una carpeta anidada para los journal. En mi caso, utilizo este
otro journal como si fuera un diario de trabajo. De esta manera, no mezclo las
entradas donde hablo de mí personalmente con las entradas de mis proyectos.

Pasando de lo básico, también se puede configurar una vista de gráfico de nodos
(muy similar a obsidian) y el uso de refile.

#+begin_src elisp :tangle config.el
(setq org-roam-graph-viewer
      (lambda (file)
        (start-process "min" nil "/usr/bin/min"
                       (concat "file://" file))))

(setq org-refile-targets
      `(("~/Documents/Emacs/Notas/Inbox.org" :maxlevel . 2)
        (,(directory-files "~/Documents/Emacs/Roam/" t "\\.org$") :maxlevel . 2)))
#+end_src

Refile es una funcióñ que permite traspasar bloques de encabezado entre archivos
o secciones de archivos org. Esto es útil para mudar cosas entre notas,
especialmente tareas pendientes.

** Plugin: org-roam-bibtex (orb)

Este plugin requiere de un archio `.bib`, el cuál va a albergar la lista de
referencias que tendremos disponibles. Para tener una manera facil de gestionar
este archivo, usaré Zotero.

Preparar el archivo de referencias:
 1. Instalar Zotero.
 2. Instalar el plugin [[https://github.com/retorquere/zotero-better-bibtex/releases/tag/v9.0.19][Better BibTex]] de Zotero.
 3. Ir a =Archivo → Exportar biblioteca=, seleccionar formato *Better BibLaTeX*,
    marcar *Keep updated* (dejar lo demás como está) y guardar el archivo en
    '~/Documents/Emacs/Roam/refs/referencias.bib'.

Luego, hay que activar ~biblio~ en el apartado tools del ~init.el~

Y también hay que cargar un plugin
#+begin_src elisp :tangle packages.el
(package! org-roam-bibtex)
#+end_src

Y configurar el plugin

#+begin_src elisp :tangle config.el

;; Decirle a 'citar' dónde está la bibliografía (necesario para orb)
(setq! citar-bibliography '("~/Documents/Emacs/Roam/refs/referencias.bib"))

;; Decirle a orb dónde buscar las citas
(setq bibtex-completion-bibliography '("~/Documents/Emacs/Roam/refs/referencias.bib"))

;; Activar orb luego de que cargue org-roam
(use-package! org-roam-bibtex
  :after org-roam
  :config
  (org-roam-bibtex-mode 1))

;; indicarle el formato e interfaz de citas a orb
(setq orb-roam-ref-format 'org-cite)
(setq orb-insert-interface 'citar)

;; Crear un atajo para crear una nota de una bibliografía
(map! :leader
      (:prefix ("n r" . "+roam")
       :desc "Crear una nota de bibliografía" "b" #'orb-insert-link))
#+end_src

Un par de notas a parte:
 1. Citar puede ser útil para gestionar citas en Org y LaTeX.
 2. Además del atajo para insertar un link, está ~M-x citar-open~ para abrir un
    menú y navegar entre las citas disponibles y hacer varias acciones.
    - Abrir el enlace del repositorio del documento.
    - Abrir el PDF asociado en Emacs.
    - Crear la nota bibliográfica (igual que el atajo).

** Plugin: org-auto-tangle

Se trata de un plugin que automatiza la acción de 'org-babel-tangle'

#+begin_src elisp :tangle packages.el
(package! org-auto-tangle)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src


* Lenguajes
** Typst
Acorde a esta [[https://forum.typst.app/t/are-there-any-best-practices-for-how-to-do-typst-in-emacs/850][discusión del foro de typst]], hay que instalar 'typst-ts-mode'
(tree-sitter), 'tinymist' (LSP) y activar 'elgot'. Por mi parte, también
instalaré 'typst-preview' porque me gusta la vista en tiempo real.

Hay que activar ~(lsp +eglot)~ y ~tree-sitter~ en ':tools' del ~init.el~.

Instalar los programas:
 - ~tinymist~

Añadir los respectivos paquetes:
#+begin_src elisp :tangle packages.el
(package! typst-ts-mode :recipe (:host codeberg :repo "meow_king/typst-ts-mode"))
(package! typst-preview :recipe (:host github :repo "havarddj/typst-preview.el"))
#+end_src

Instalar el lenguaje en el tree-sitter
 1. Asegurarnos de instalar los paquetes: ~doom sync~ y regargar emacs.
 2. Dentro de Emacs ~M-x treesit-install-language-grammar~.
 3. Elegir ~typst~.
 4. Si pide URL: https://github.com/uben0/tree-sitter-typst.
 5. El resto en default.

Y configurar las opciones
#+begin_src elisp :tangle config.el

;; Asociar los archivos
(add-to-list 'auto-mode-alist '("\\.typ\\'" . typst-ts-mode))

;; Decirle a org que Typst existe
(with-eval-after-load 'org
  (add-to-list 'org-src-lang-modes '("typst" . typst-ts)))

;; Activar Elgot
(add-hook 'typst-ts-mode-hook #'eglot-ensure)

;; Configurar Elgot para typst
(with-eval-after-load 'eglot
  (with-eval-after-load 'typst-ts-mode
    (add-to-list 'eglot-server-programs
                 `((typst-ts-mode) .
                   ,(eglot-alternatives `(,typst-ts-lsp-download-path
                                          "tinymist"))))))

;; Hacer funcionar typst-preview
(use-package! typst-preview
  :config
  (setq typst-preview-executable "/run/current-system/sw/bin/tinymist")
  (setq typst-preview-browser "default")
  ;; Utilzar Gnome Web
  (setq browse-url-browser-function 'browse-url-generic)
  (setq browse-url-generic-program "/run/current-system/sw/bin/epiphany")
)

;; Insertar citas de forma facil
(defun dp/citar-insert-typst-normal ()
  (interactive)
  (let ((key (car (citar-select-refs))))
    (insert (concat "#cite(<" key ">, form: \"normal\")"))))
(defun dp/citar-insert-typst-prose ()
  (interactive)
  (let ((key (car (citar-select-refs))))
    (insert (concat "#cite(<" key ">, form: \"prose\")"))))
#+end_src

Para la parte de las citas, hay que habilitar ~biblio~, ~vertico~ y ~lookup~ en
el ~init.el~ (algunas funciones ya están activadas) y configurar citar. En mi
caso ya configuré citar en [[*Plugin: org-roam-bibtex (orb)][Org-Roam-Bibtex]].

También incluí dos lineas para que me abra Web (navegador de GNOME) en lugar de
mi navegador por defecto. De esta manera, puedo separar mi navegador de internet
y dedica otra aplicación a la previsualización de documentos.

* Extras
** Plugin: evil-tutor

Se ttrata de un plugin sencillo que abre archivos tipo manual para poder
aprender y practicar los atajos de vim en emacs (el evil-mode).
#+begin_src elisp :tangle packages.el
(package! evil-tutor)
#+end_src


* Comentarios Originales
** Config

#+begin_src elisp

;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `with-eval-after-load' block, otherwise Doom's defaults may override your
;; settings. E.g.
;;
;;   (with-eval-after-load 'PACKAGE
;;     (setq x y))
;;
;; The exceptions to this rule:
;;
;;   - Setting file/directory variables (like `org-directory')
;;   - Setting variables which explicitly tell you to set them before their
;;     package is loaded (see 'C-h v VARIABLE' to look them up).
;;   - Setting doom variables (which start with 'doom-' or '+').
;;
;; Here are some additional functions/macros that will help you configure Doom.
;;
;; - `load!' for loading external *.el files relative to this one
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

#+end_src

** Packages

#+begin_src elisp

;; To install a package:
;;
;;   1. Declare them here in a `package!' statement,
;;   2. Run 'doom sync' in the shell,
;;   3. Restart Emacs.
;;
;; Use 'C-h f package\!' to look up documentation for the `package!' macro.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/radian-software/straight.el#the-recipe-format
;; (package! another-package
;;   :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;; (package! this-package
;;   :recipe (:host github :repo "username/repo"
;;            :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;; (package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;; (package! builtin-package :recipe (:nonrecursive t))
;; (package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see radian-software/straight.el#279)
;; (package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;; (package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;; (unpin! pinned-package)
;; ...or multiple packages
;; (unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;; (unpin! t)

#+end_src

